using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l3t4
{
    /*
     * Внутри метода Main() объявите целочисленную переменную, имя придумайте сами.
     * Считайте с клавиатуры целое число и присвойте его своей переменной. 
     * Выведите на экран квадрат введенного числа.
     */

    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
            int aboba = Convert.ToInt32(Console.ReadLine());
            Console.WriteLine(aboba * aboba);
        }
    }
}
