using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l3t2
{
    /*
     * Внутри метода Main() объявите две целочисленные переменные, присвойте им значения 5 и 17. 
     * Объявите еще 1 целочисленную переменную, присвойте ей результат умножения первых двух переменных. 
     * Выведите на экран значение третьей переменной.
     */

    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
            int first = 5;
            int second = 17;
            int answer = first * second;
            Console.WriteLine(answer);
        }
    }
}
