using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace l1t1
{
    /*
     * Привет! 
     * Это самая первая и по сути просто обучающая задача, таких задач будет ещё немного во второй лекции!
     * Суть этой задачи проста - научить тебя пользоваться расширением для VS.
     * На панели IDE сверху, ты найдешь 5 кнопок управления:
     *      1) Основное меню навигации, где есть инвентарь и выбор курса\лекции\задачи.
     *      2) Зелёная галочка, которая отправит твоё решение на проверку.
     *      3) Красные стрелки нужны чтобы начать решение задачи заново, при этом твой код будет удалён!
     *      4) Восклицательный знак в желтом треугольнике - покажет результаты прошлых проверок этой задачи.
     *      5) Ну и черный гаечный ключ - это твой способ обратной связи, как для запуска аварийных маячков, 
     *         так и для того чтобы сообщить о проблеме в командный центр NYSS.
     *         
     *  Каждая задача в NYSS, это твой соперник - монстр которого нужно победить! За правильное решение - ты будешь
     *  получать награду: предметы, монетки, опыт и прочие вещи, которые пригодятся тебе для дальнейшего прохождения.
     *  
     *  За каждую неудачное попытку решить задачу, твоему персонажу будет наносится урон и если вовремя не использовать 
     *  аптечку...ну я думаю ты и сам знаешь, что произойдёт =)))
     *
     *  Все расходники можно выбить, либо приобрести в магазине за выпадающие с монстров монетки.
     *  
     *  На этом всё, вторую лекцию ты уже открыл - так что можно приступать к решению её задач, а чтобы эта задачка 
     *  засчиталась и ты получил заслуженное вознаграждение - просто нажми на зеленую галочку и отправь её на проверку!
     *
     *  Успехов!!!
     * 
     */


    public class Program
    {
        public static void Main(string[] args)
        {
            /* Добавьте свой код ниже */
        }
    }
}
